pop_song = [
	{
		"source":10019910,
		"label":"1",
		"startdate":"2016-09-30",
		"enddate":"2016-10-08",
		"event":5028,
		"days":[
			{"songs":[1001, 1002, 1008, 1009, 3007, 1010, 3008, 3024, 3003, 3020], "comment":""},
			{"songs":[1001, 1002, 3001, 3010, 3002, 3005, 3011, 3012, 1011, 3009], "comment":""},
			{"songs":[1003, 1018, 1004, 3004, 3029, 1014, 3028, 1012, 1013, 3025], "comment":""},
			{"songs":[5001, 5025, 5002, 1021, 5008, 5007, 3002, 3003, 5009, 3018], "comment":""},
			{"songs":[1020, 5024, 5003, 5010, 3033, 3001, 3027, 3019, 5021, 5015], "comment":""},
			{"songs":[9001, 9006, 9003, 9007, 3023, 3013, 3021, 3014, 1024, 3015], "comment":""},
			{"songs":[9001, 9009, 9004, 9005, 1022, 3017, 1023, 3024, 3026, 3006], "comment":""},
			{"songs":[1003, 1028, 9008, 9002, 3038, 1022, 1023, 3034, 3037, 1024], "comment":""},
			{"songs":[5028, 5001, 5004, 5008, 5005, 5006, 5007, 5021, 5015, 5009], "comment":""}
		]
	},{
		"source":10021500,
		"label":"2",
		"startdate":"2016-11-30",
		"enddate":"2016-12-08",
		"event":1029,
		"days":[
			{"songs":[1029, 1001, 1020, 5010, 3038, 3033, 1022, 3039, 3011, 3018], "comment":""},
			{"songs":[1002, 1008, 5001, 1004, 3005, 5006, 1010, 3017, 3006, 3003], "comment":""},
			{"songs":[1003, 5011, 9002, 5010, 3029, 1014, 3002, 1011, 3026, 3025], "comment":""},
			{"songs":[5028, 5003, 5004, 5024, 3001, 2001, 5021, 3027, 3028, 3003], "comment":""},
			{"songs":[1029, 9003, 1030, 9004, 3015, 3009, 1011, 3013, 3031, 3034], "comment":""},
			{"songs":[1018, 9007, 1004, 9009, 3042, 3021, 5007, 3024, 5009, 3018], "comment":""},
			{"songs":[5025, 9006, 5002, 5001, 3023, 3004, 1012, 3012, 3037, 1024], "comment":""},
			{"songs":[1028, 9005, 9001, 9008, 3007, 5005, 1023, 3008, 1013, 3020], "comment":""},
			{"songs":[1029, 5003, 1021, 1003, 3010, 1009, 5008, 3014, 2002, 5015], "comment":""}
		]
	},{
		"source":10023100,
		"label":"3",
		"startdate":"2017-01-31",
		"enddate":"2017-02-07",
		"event":9011,
		"days":[
			{"songs":[9011, 5003, 1001, 9002, 1009, 3012, 3002, 3001, 3003, 3021], "comment":"２行目＝Yes! Party Time!!の五人 （1/25：CD発売：Yes! Party Time!!（M@STER VERSION)・GOIN’!!!・アタシポンコツアンドロイド）、（ニュージェネレーション）GOIN'!!!+お願い ! シンデレラ"},
			{"songs":[9009, 1003, 1028, 9005, 3033, 3023, 1023, 3031, 3034, 3032], "comment":"（生存本能ヴァルキュリア＋Bright Blue）鷺沢文香役のM・A・Oの誕生日"},
			{"songs":[5001, 5010, 5011, 9001, 3042, 2003, 3005, 1010, 5009, 3006], "comment":"ツインテールの日 (ソロはツインテールのキャラ)、Shine!! + 夢色ハーモニー"},
			{"songs":[9011, 1004, 1020, 1021, 3004, 1014, 3013, 3014, 3009, 3015], "comment":""},
			{"songs":[9004, 9003, 5029, 3029, 3040, 3036, 3027, 3011, 3026, 3025], "comment":""},
			{"songs":[1001, 1002, 5028, 3007, 1022, 3024, 3028, 5030, 3037, 5015], "comment":"植物の名前のキャラのシングル（？）"},
			{"songs":[9007, 1030, 5025, 3010, 2001, 3039, 3008, 1012, 1024, 1011], "comment":""},
			{"songs":[9011, 1029, 9006, 3017, 3038, 2002, 3019, 3018, 1013, 3020], "comment":""}
		]
	},{
		"source":10025080,
		"label":"4",
		"startdate":"2017-04-01",
		"enddate":"2017-04-08",
		"event":5027,
		"days":[
			{"songs":[5027, 1003, 9003, 1001, 3031, 3038, 3039, 3034, 3033, 3015], "comment":"LiPPS（Tulip＋２行目の五人）"},
			{"songs":[5028, 3036, 3009, 1029, 5007, 9009, 3023, 1002, 3005, 9002], "comment":"SiDEM (SideM), BEYOND THE + ドリーム (THE IDOLM@STER SideM GREETING TOUR 2017 ～BEYOND THE DREAM～), DRAMATIC STARS (輝(天道[輝]) + 内田真礼([桜庭薫]役 内田雄馬の姉) + Wings(柏木[翼]))"},
			{"songs":[1001, 3001, 2001, 3017, 1030, 9011, 3026, 3045, 3002, 3003], "comment":"ラブレター（ピンクチェックスクール）の三人、(お願い ! シンデレラ・Treasure☆)ニュージェネレーションの三人"},
			{"songs":[5027, 9007, 9010, 9006, 3007, 3027, 3008, 3011, 1013, 3006], "comment":"あんきら・LOVE LAIKA・（神谷奈緒＋諸星きらり）「松井恵理子・松嵜麗の声優アニ雑団」の放送日「松井恵理子・松嵜麗の声優アニ雑団」の放送日（火曜日）"},
			{"songs":[9001, 1021, 1008, 3042, 3021, 1023, 3028, 2004, 1024, 5015], "comment":""},
			{"songs":[1020, 9004, 9001, 5010, 3040, 3013, 3024, 3012, 3025, 5009], "comment":""},
			{"songs":[9008, 5029, 5025, 3010, 2003, 2002, 3019, 3020, 3037, 3030], "comment":"サマカニ!!（川島瑞樹・日野茜・堀裕子）"},
			{"songs":[5027, 5003, 1004, 9005, 3029, 3004, 3014, 5031, 3018, 3032], "comment":""}
		]
	},{
		"source":10027050,
		"label":"5",
		"startdate":"2017-05-31",
		"enddate":"2017-06-08",
		"event":9014,
		"days":[
			{"songs":[9014, 3006, 2003, 3007, 1001, 3005, 3027, 9010, 9002, 3002], "comment":""},
			{"songs":[1002, 3014, 2004, 1023, 1020, 3029, 3020, 3003, 3025, 3010], "comment":""},
			{"songs":[5001, 9006, 5030, 9008, 1011, 1010, 3013, 9011, 3018, 3004], "comment":""},
			{"songs":[9007, 9009, 9003, 2001, 5027, 3019, 3008, 3039, 3009, 3015], "comment":""},
			{"songs":[9014, 1003, 5029, 3042, 3045, 3038, 3034, 3036, 3043, 3037], "comment":""},
			{"songs":[1001, 5025, 5010, 5024, 5005, 5008, 5021, 5018, 5009, 5015], "comment":""},
			{"songs":[2005, 3026, 5031, 3024, 3023, 9001, 3028, 1013, 1024, 1004], "comment":"星輝子の誕生日"},
			{"songs":[3021, 3040, 9004, 3012, 3030, 2002, 1030, 9005, 3001, 5026], "comment":""},
			{"songs":[9014, 1021, 9012, 9001, 3017, 3033, 3031, 3011, 3032, 3041], "comment":""}
		]
	},{
		"source":10029100,
		"label":"6 (初期設定)",
		"startdate":"2017-07-31",
		"enddate":"2017-08-08",
		"event":1031,
		"days":[
			{"songs":[1031, 9005, 1023, 1028, 5011, 3033, 3039, 3036, 3040, 3012], "comment":""},
			{"songs":[9009, 5029, 2005, 9001, 3007, 2003, 1009, 3019, 3018, 3020], "comment":""},
			{"songs":[1029, 3009, 9013, 3035, 5008, 3027, 3042, 3010, 3008, 3026], "comment":""},
			{"songs":[9003, 9014, 9902, 1003, 2001, 3029, 5026, 3043, 5030, 3003], "comment":""},
			{"songs":[1001, 5003, 9008, 3022, 3045, 3002, 3024, 3031, 2006, 3025], "comment":"8/5と２行目を交換される"},
			{"songs":[1031, 5028, 9007, 3017, 5027, 3028, 3034, 5018, 2004, 1013], "comment":"8/6と２行目を交換される"},
			{"songs":[3032, 5001, 2002, 9011, 3006, 3001, 9012, 5010, 9002, 3015], "comment":""},
			{"songs":[9006, 9004, 1002, 1020, 3013, 3038, 3014, 3005, 3030, 5015], "comment":""},
			{"songs":[3023, 3021, 9010, 3037, 5031, 1031, 3004, 3041, 3011, 1004], "comment":""}
		]
	},{
		"source":10029160,
		"label":"6 (後期設定)",
		"startdate":"2017-07-31",
		"enddate":"2017-08-08",
		"event":1031,
		"days":[
			{"songs":[1031, 9005, 1023, 1028, 5011, 3033, 3039, 3036, 3040, 3012], "comment":""},
			{"songs":[9009, 5029, 2005, 9001, 3007, 2003, 1009, 3019, 3018, 3020], "comment":""},
			{"songs":[1029, 3009, 9013, 3035, 5008, 3027, 3042, 3010, 3008, 3026], "comment":""},
			{"songs":[9003, 9014, 9902, 1003, 2001, 3029, 5026, 3043, 5030, 3003], "comment":""},
			{"songs":[1001, 5003, 9008, 3022, 3045, 3028, 3034, 5018, 2004, 1013], "comment":""},
			{"songs":[1031, 5028, 9007, 3017, 5027, 3002, 3024, 3031, 2006, 3025], "comment":""},
			{"songs":[3032, 5001, 2002, 9011, 3006, 3001, 9012, 5010, 9002, 3015], "comment":""},
			{"songs":[9006, 9004, 1002, 1020, 3013, 3038, 3014, 3005, 3030, 5015], "comment":""},
			{"songs":[3023, 3021, 9010, 3037, 5031, 1031, 3004, 3041, 3011, 1004], "comment":""}
		]
	},{
		"source":10031200,
		"label":"7",
		"startdate":"2017-09-30",
		"enddate":"2017-10-09",
		"event":1033,
		"days":[
			{"songs":[1033, 1032, 9002, 3040, 2001, 3007, 2008, 2002, 1024, 2006], "comment":""},
			{"songs":[9006, 3016, 5026, 3019, 1001, 1020, 3023, 3024, 5015, 3026], "comment":""},
			{"songs":[9009, 9012, 2005, 5028, 3004, 3029, 2007, 3028, 3025, 3041], "comment":""},
			{"songs":[9902, 9011, 3015, 9004, 5010, 3021, 3017, 3014, 3008, 3035], "comment":""},
			{"songs":[1033, 9003, 1003, 9015, 3033, 2003, 1023, 3031, 3034, 3012], "comment":""},
			{"songs":[5029, 5003, 9010, 9013, 1022, 3042, 3039, 3011, 3018, 1011], "comment":""},
			{"songs":[1004, 9005, 9014, 9007, 1014, 3045, 3043, 3030, 3006, 3032], "comment":""},
			{"songs":[1021, 5005, 5021, 5030, 5017, 5027, 3036, 3009, 1029, 5007], "comment":""},
			{"songs":[5025, 3027, 3037, 3013, 2004, 5001, 3001, 3002, 3003, 5004], "comment":"ニュージェネレーションの三人"},
			{"songs":[1033, 9008, 1030, 9016, 3022, 3038, 3010, 3005, 5031, 3020], "comment":""}
		]
	},{
		"source":10032800,
		"label":"8",
		"startdate":"2017-11-30",
		"enddate":"2017-12-09",
		"event":1036,
		"days":[
			{"songs":[1035, 3044, 3042, 3014, 1034, 1036, 2005, 5015, 9006, 3020], "comment":""},
			{"songs":[9016, 1030, 3003, 1011, 2004, 9002, 3021, 3010, 3019, 3027], "comment":""},
			{"songs":[9012, 9008, 5024, 9015, 3029, 3040, 3031, 2002, 3026, 3035], "comment":""},
			{"songs":[5026, 5027, 5029, 5031, 5030, 3007, 3022, 9001, 3041, 3030], "comment":""},
			{"songs":[9007, 9902, 5028, 5003, 2003, 1022, 3043, 3036, 2006, 5013], "comment":""},
			{"songs":[1002, 1003, 1020, 1032, 1036, 3004, 3013, 2007, 5021, 2009], "comment":""},
			{"songs":[3028, 3034, 3008, 3011, 9004, 3015, 9005, 3023, 3033, 3006], "comment":""},
			{"songs":[9003, 9009, 9013, 1004, 3038, 1009, 2008, 5018, 3037, 3025], "comment":""},
			{"songs":[1001, 1013, 3018, 9011, 3032, 3005, 3002, 3039, 3001, 3016], "comment":"シンデレラガール総選挙 歴代結果　（シンデレラ＋一等賞）"},
			{"songs":[9010, 1014, 1036, 3045, 3024, 9014, 2001, 3017, 3012, 3009], "comment":"１行目＝恋・２行目＝LOVE / Romantic / DOKIDOKI"}
		]
	},{
		"source":10035100,
		"label":"9 (初期設定)",
		"startdate":"2018-01-31",
		"enddate":"2018-02-08",
		"event":1040,
		"days":[
			{"songs":[3019, 5009, 1003, 1020, 9902, 9002, 1040, 3023, 3016, 3003], "comment":""},
			{"songs":[9003, 1002, 9005, 3038, 3022, 3031, 3028, 2002, 1011, 3041], "comment":""},
			{"songs":[1032, 3042, 3005, 3018, 5002, 2009, 3017, 3015, 3034, 3004], "comment":""},
			{"songs":[1029, 2008, 3043, 1023, 9015, 5003, 3044, 5008, 5015, 3008], "comment":""},
			{"songs":[1040, 9016, 1038, 3013, 2007, 2001, 5031, 5026, 2004, 2006], "comment":""},
			{"songs":[3006, 9006, 1037, 3024, 3029, 3027, 9008, 3032, 3037, 3001], "comment":""},
			{"songs":[9014, 9007, 1035, 3021, 3045, 2003, 3011, 3002, 3025, 3030], "comment":""},
			{"songs":[9009, 1001, 1034, 3033, 1014, 3036, 2010, 5007, 3020, 3012], "comment":""},
			{"songs":[1040, 1024, 3035, 9004, 3010, 1028, 3014, 3040, 3039, 1036], "comment":"恋が咲く季節(アイコン改変)"}
		]
	},{
		"source":10035100,
		"label":"9 (後期設定)",
		"startdate":"2018-01-31",
		"enddate":"2018-02-08",
		"event":1040,
		"days":[
			{"songs":[3019, 5009, 1003, 1020, 9902, 9002, 1040, 3023, 3016, 3003], "comment":""},
			{"songs":[9003, 1002, 9005, 3038, 3022, 3031, 3028, 2002, 1011, 3041], "comment":"３列目＝鷺沢文香役のM・A・Oの誕生日"},
			{"songs":[1032, 3042, 3005, 3018, 5002, 2009, 3017, 3015, 3034, 3004], "comment":""},
			{"songs":[1029, 2008, 3043, 1023, 9015, 5003, 3044, 5008, 5015, 3008], "comment":""},
			{"songs":[1040, 9016, 1038, 3013, 2007, 2001, 5031, 5026, 2004, 2006], "comment":""},
			{"songs":[3006, 9006, 1037, 3024, 3029, 3027, 9008, 3032, 3037, 3001], "comment":"(冬)空プレシャス + (サマ)カニ ! ! + (プロ野球の日)気持ちいいよね一等賞 ! + (笑顔の日) S(mile)ING!"},
			{"songs":[9014, 9007, 1035, 3021, 3045, 2003, 3011, 3002, 3025, 3030], "comment":""},
			{"songs":[9009, 1001, 1034, 3033, 1014, 3036, 2010, 5007, 3020, 3012], "comment":""},
			{"songs":[1040, 1024, 3035, 9004, 3010, 1028, 3014, 3040, 3039, 1047], "comment":"市原仁奈の誕生日（きみにいっぱい☆、みんなのきもち、ハイファイ☆デイズ）"}
		]
	},{
		"source":10037400,
		"label":"10",
		"startdate":"2018-04-02",
		"enddate":"2018-04-09",
		"event":9903,
		"days":[
			{"songs":[3036, 3022, 3024, 3026, 9903, 3009, 9015, 5031, 1001, 3033], "comment":""},
			{"songs":[9013, 9017, 3046, 3023, 3019, 3011, 1037, 3037, 3041, 3035], "comment":""},
			{"songs":[5029, 3029, 2011, 3039, 9002, 9006, 3042, 3031, 3032, 3020], "comment":""},
			{"songs":[2009, 9007, 3004, 9009, 9903, 3007, 3017, 3016, 3030, 3006], "comment":""},
			{"songs":[2001, 3038, 3028, 3018, 3025, 2005, 9005, 3034, 2010, 9003], "comment":""},
			{"songs":[1020, 5003, 3001, 3010, 3013, 2003, 3002, 3014, 3012, 3015], "comment":""},
			{"songs":[3044, 1022, 3040, 9004, 9012, 1041, 3005, 2008, 3043, 1002], "comment":"櫻井桃華の誕生日（明日また会えるよね、ラヴィアンローズ、ハイファイ☆デイズ）"},
			{"songs":[1004, 3027, 1047, 3021, 9903, 3045, 3003, 1048, 3008, 5015], "comment":""}
		]
	},{
		"source":10039700,
		"label":"11",
		"startdate":"2018-05-31",
		"enddate":"2018-06-07",
		"event":2012,
		"days":[
			{"songs":[9006, 1020, 2012, 9005, 1011, 9009, 2002, 3039, 3001, 3010], "comment":""},
			{"songs":[3040, 3038, 3005, 3024, 3020, 3006, 3032, 3025, 5003, 1035], "comment":""},
			{"songs":[3031, 3012, 1048, 5026, 3009, 3017, 1029, 9014, 5007, 3044], "comment":"BRaNDNEWMl(THE IDOLM@STER MILLION LIVE! 5thLIVE BRAND NEW PERFORM@NCE!!!)"},
			{"songs":[9011, 2006, 5030, 3022, 5014, 3023, 3043, 3008, 3002, 1042], "comment":"及川雫の誕生日（Sweet Witches' Night ～6人目はだぁれ～、モーレツ★世直しギルティ !、Flip Flop）"},
			{"songs":[2012, 1024, 9002, 3041, 9007, 3021, 3042, 3028, 3027, 3037], "comment":""},
			{"songs":[3007, 3013, 3046, 3011, 3034, 3036, 3018, 3015, 3003, 9903], "comment":""},
			{"songs":[2005, 5031, 3026, 9013, 3004, 3045, 5032, 3016, 3014, 1044], "comment":"星輝子の誕生日"},
			{"songs":[2012, 3033, 3029, 3047, 3019, 3035, 5015, 3030, 9902, 9004], "comment":""}
		]
	},{
		"source":10042200,
		"label":"12",
		"startdate":"2018-07-31",
		"enddate":"2018-08-07",
		"event":2013,
		"days":[
			{"songs":[2013, 1023, 9005, 9004, 3033, 3007, 3008, 3034, 3044, 3012], "comment":"橘ありすの誕生日（咲いてJewel、生存本能ヴァルキュリア）"},
			{"songs":[1046, 3037, 3018, 5033, 1047, 2006, 3032, 3013, 9002, 3031], "comment":"棟方愛海の誕生日（HARURUNRUN）"},
			{"songs":[9903, 3046, 3001, 3040, 3024, 3011, 3016, 3015, 3009, 3025], "comment":""},
			{"songs":[1009, 3021, 2013, 1034, 5017, 1032, 9017, 9010, 3019, 3006], "comment":""},
			{"songs":[1014, 5007, 1029, 3023, 9003, 3036, 3017, 5003, 3020, 2004], "comment":""},
			{"songs":[9016, 3038, 3010, 3045, 3028, 3005, 3002, 3048, 3026, 3035], "comment":""},
			{"songs":[2011, 3042, 3004, 3029, 3043, 3039, 3027, 3047, 3003, 3030], "comment":""},
			{"songs":[2005, 3014, 3022, 1048, 2007, 2013, 3041, 9006, 2012, 1020], "comment":"向井拓海の誕生日（純情Midnight伝説、Virgin Love）"}
		]
	},{
		"source":10045200,
		"label":"13",
		"startdate":"2018-09-30",
		"enddate":"2018-10-08",
		"event":9019,
		"days":[
			{"songs":[3040, 9004, 9019, 9902, 3036, 3012, 1022, 1023, 1024, 3035], "comment":""},
			{"songs":[3047, 5026, 9006, 3024, 2002, 1046, 3010, 1044, 9903, 1047], "comment":""},
			{"songs":[9001, 2009, 7003, 7007, 2014, 3049, 1049, 9008, 7005, 1048], "comment":""},
			{"songs":[3001, 3038, 2013, 3002, 3039, 3009, 3025, 9019, 9015, 5003], "comment":""},
			{"songs":[9009, 2006, 7008, 2005, 2011, 9018, 3006, 5033, 1014, 3013], "comment":""},
			{"songs":[2007, 3022, 2010, 3016, 3028, 1041, 3032, 5030, 9012, 1045], "comment":""},
			{"songs":[3046, 1034, 9014, 3023, 3017, 3008, 3043, 3044, 3048, 9010], "comment":""},
			{"songs":[3018, 2012, 3042, 5015, 3033, 5031, 5018, 9017, 1042, 1038], "comment":""},
			{"songs":[2003, 5032, 2008, 5007, 3003, 1037, 2004, 1035, 9019, 9002], "comment":""}
		]
	},{
		"source":10047900,
		"label":"14 (初期設定)",
		"startdate":"2018-11-30",
		"enddate":"2018-12-08",
		"event":1051,
		"days":[
			{"songs":[1051, 1028, 1038, 9013, 1032, 3010, 3008, 3043, 3028, 3030], "comment":""},
			{"songs":[9017, 2004, 3003, 5004, 9016, 3022, 3048, 3014, 3021, 3050], "comment":""},
			{"songs":[1001, 1048, 1044, 1047, 7007, 3016, 3023, 3025, 3040, 3026], "comment":""},
			{"songs":[1051, 9018, 5003, 3013, 3029, 3019, 3034, 3031, 3020, 3037], "comment":""},
			{"songs":[5010, 2002, 9011, 3001, 5028, 3039, 2007, 2008, 9015, 3045], "comment":"Sweet Witches' Night ～6人目はだぁれ～、恋のHamburg♪→HARURUNRUN、shabon song ～For SS3A rearrange Mix～"},
			{"songs":[9006, 9012, 1045, 5032, 1046, 2014, 2016, 2012, 3032, 3041], "comment":"HARURUNRUN→One Life"},
			{"songs":[1049, 9008, 1020, 9019, 2013, 5007, 3036, 1011, 5034, 2009], "comment":""},
			{"songs":[9007, 2005, 1035, 1034, 5014, 3042, 2010, 3002, 2006, 3006], "comment":"Heart Voice、ましゅまろ☆キッス→あんきら ! ？狂騒曲、Naked Romance"},
			{"songs":[1051, 9002, 1042, 2001, 3049, 3046, 1041, 7005, 3027, 1037], "comment":"追い風Running、Flip Flop ～For SS3A rearrange Mix～、2nd SIDE	、冬空プレシャス→Sweet Witches' Night ～6人目はだぁれ～、アップルパイ・プリンセス、絶対特権主張しますっ !、ゴキゲンParty Night"}
		]
	},{
		"source":10048000,
		"label":"14 (後期設定)",
		"startdate":"2018-11-30",
		"enddate":"2018-12-08",
		"event":1051,
		"days":[
			{"songs":[1051, 1028, 1038, 9013, 1032, 3010, 3008, 3043, 3028, 3030], "comment":"You(１行目＝君、You、キミ、You、you)"},
			{"songs":[9017, 2004, 3003, 5004, 9016, 3022, 3048, 3014, 3021, 3050], "comment":"本田未央の誕生日（１行目＝本田未央の出演曲目）"},
			{"songs":[1001, 1048, 1044, 1047, 7007, 3016, 3023, 3025, 3040, 3026], "comment":"喜多見柚の誕生日（１行目(2~5)＝喜多見柚の出演曲目）"},
			{"songs":[1051, 9018, 5003, 3013, 3029, 3019, 3034, 3031, 3020, 3037], "comment":""},
			{"songs":[5010, 2002, 1046, 3001, 5028, 3039, 2007, 2008, 9015, 7003], "comment":"THE IDOLM@STER（Shine!!：天道「輝」(SideM)、（天海春香・春日未来）(「HARU」RUNRUN、Jet to the 「Future」)(THE IDOLM@STER + MILLION LIVE!)、島村卯月(S(mile)ING!)(シンデレラガールズ)、「櫻」木真乃(STORY（ジャケットデザイン）)）(SHINY COLORS)"},
			{"songs":[9006, 9012, 1045, 5032, 2014, 3047, 2016, 2012, 3032, 3041], "comment":"春（桜の頃、桜の風、キラッ ! 満開スマイル）、メラド1日目のセトリ"},
			{"songs":[1049, 9008, 1020, 9019, 2013, 5007, 3036, 1011, 5034, 2009], "comment":"夏（銀のイルカと熱い風、サマカニ ! !、Absolute NIne、Orange Sapphire、SUN♡FLOWER、Twin☆くるっ★テール）、メラド2日目のセトリ"},
			{"songs":[9007, 2005, 1035, 1034, 2003, 3042, 3017, 3002, 2010, 2006], "comment":"秋（秋風に手を振って、ナゴド1日目のセトリ、Halloween♥Code）"},
			{"songs":[1051, 9011, 3018, 1013, 1017, 9002, 1042, 2001, 3049, 1041], "comment":"冬（Snow Wings、Frost、ツインテールの風）、ナゴド2日目のセトリ、十時愛梨の誕生日（Sweet Witches' Night ～6人目はだぁれ～、アップルパイ・プリンセス、絶対特権主張しますっ !）"}
		]
	},{
		"source":10050800,
		"label":"15",
		"startdate":"2019-01-31",
		"enddate":"2019-02-08",
		"event":2020,
		"days":[
			{"songs":[2020, 1038, 9012, 3045, 3007, 1041, 3027, 3012, 2017, 5030], "comment":"最初の３曲＝イベント３人の共演曲、Frost（珠美）、Flip Flop（脇山珠美、道明寺歌鈴）"},
			{"songs":[5022, 9009, 9005, 5029, 5027, 2018, 1012, 3019, 5013, 2021], "comment":"生存本能ヴァルキュリア＝鷺沢文香役のM・A・Oの誕生日"},
			{"songs":[3018, 3004, 1042, 3042, 5006, 9001, 1014, 2009, 1022, 1010], "comment":"ツインテールの日（３列目＝ツインテール、１行目＝ツインテールアイドルのシングル、２行目＝アイドルの対応のグループソング）"},
			{"songs":[1029, 1023, 3043, 2008, 9015, 2020, 3049, 9020, 3051, 3030], "comment":"二宮飛鳥の誕生日（１行目＝二宮飛鳥の出演曲目・Starry-Go-Round）"},
			{"songs":[1050, 9006, 1004, 3033, 3038, 3014, 2002, 2016, 5015, 3009], "comment":"２行目＝ロックソング（ザ・ビートルズの日（？））"},
			{"songs":[9002, 1003, 2011, 1009, 3017, 3011, 2015, 3015, 3006, 3020], "comment":"美（「美」に入り彩を穿つ、美穂、美波、Pretty、美嘉）"},
			{"songs":[1021, 9003, 1045, 3029, 3040, 3005, 3031, 3037, 3025, 3044], "comment":"植物の名前のソング・キャラ（１行目＝つぼみ・Tulip・桜・花簪・ローズ：ソング、２行目＝(華蕾/蘭)・鷺・桐・藍・(lilac/葉)：キャラ）"},
			{"songs":[1044, 3022, 5003, 9007, 3046, 9014, 1001, 3024, 3013, 5026], "comment":"東郷あいの誕生日（(To) my darling... + (GO)IN'!!! + (Love)∞Destiny）"},
			{"songs":[9019, 9004, 3035, 1024, 9902, 2020, 3021, 3050, 3010, 3016], "comment":"市原仁奈の誕生日（１行目＝U149 + 市原仁奈の出演曲目）"}
		]
	},{
		"source":10053610,
		"label":"16",
		"startdate":"2019-04-02",
		"enddate":"2019-04-09",
		"event":2023,
		"days":[
			{"songs":[2023, 5032, 5033, 5034, 5003, 1008, 3007, 3028, 3006, 2006], "comment":""},
			{"songs":[1030, 1023, 3048, 9019, 5025, 5001, 1046, 1044, 1052, 3052], "comment":""},
			{"songs":[2022, 9006, 5028, 5024, 3013, 2007, 5020, 3034, 3041, 3032], "comment":""},
			{"songs":[1001, 1002, 9903, 3020, 3043, 5017, 5008, 5015, 5031, 3009], "comment":""},
			{"songs":[2023, 1035, 1050, 2004, 1029, 3046, 3004, 3015, 3023, 3008], "comment":""},
			{"songs":[9010, 9014, 5029, 3033, 3010, 3045, 3050, 3011, 3051, 3012], "comment":""},
			{"songs":[2011, 2008, 3005, 5018, 3018, 9902, 9004, 3040, 1022, 1020], "comment":""},
			{"songs":[2023, 1048, 2019, 1047, 2013, 3027, 3021, 1010, 3003, 2012], "comment":""}
		]
	}
];
/*{
		"source":,
		"label":"",
		"startdate":"",
		"enddate":"",
		"event":,
		"days":[
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""},
			{"songs":[], "comment":""}
		]
	}*/
jacket = {"1001":{"name":"お願い ! シンデレラ","type":4},"1002":{"name":"輝く世界の魔法","type":4},"1003":{"name":"We're the friends!","type":4},"1004":{"name":"メッセージ","type":4},"1005":{"name":"ススメ☆オトメ \n～jewel parade～","type":1},"1006":{"name":"ススメ☆オトメ \n～jewel parade～","type":2},"1007":{"name":"ススメ☆オトメ \n～jewel parade～","type":3},"1008":{"name":"ススメ☆オトメ \n～jewel parade～","type":4},"1009":{"name":"アタシポンコツ\nアンドロイド","type":1},"1010":{"name":"Nation Blue","type":2},"1011":{"name":"Orange Sapphire","type":3},"1012":{"name":"オルゴールの小箱","type":2},"1013":{"name":"絶対特権\n主張しますっ !","type":3},"1014":{"name":"パステルピンクな恋","type":1},"1015":{"name":"ゴキゲンParty Night","type":1},"1016":{"name":"ゴキゲンParty Night","type":2},"1017":{"name":"ゴキゲンParty Night","type":3},"1018":{"name":"ゴキゲンParty Night","type":4},"1019":{"name":"ゴキゲンParty Night","type":4},"1020":{"name":"Absolute NIne","type":4},"1021":{"name":"つぼみ","type":4},"1022":{"name":"明日また会えるよね","type":1},"1023":{"name":"咲いてJewel","type":2},"1024":{"name":"きみにいっぱい☆","type":3},"1025":{"name":"Near to You","type":1},"1026":{"name":"Near to You","type":2},"1027":{"name":"Near to You","type":3},"1028":{"name":"Near to You","type":4},"1029":{"name":"EVERMORE","type":4},"1030":{"name":"Treasure☆","type":4},"1031":{"name":"Take me☆Take you","type":4},"1032":{"name":"Take me☆Take you","type":4},"1033":{"name":"キミのそばでずっと","type":4},"1034":{"name":"Halloween♥Code","type":1},"1035":{"name":"秋風に手を振って","type":4},"1036":{"name":"恋が咲く季節","type":4},"1037":{"name":"冬空プレシャス","type":3},"1038":{"name":"キミのそばでずっと","type":4},"1039":{"name":"こいかぜ -花葉-","type":2},"1040":{"name":"always","type":4},"1041":{"name":"Frost","type":2},"1042":{"name":"ツインテールの風","type":4},"1043":{"name":"Tulip\n（SP VERSION）","type":4},"1044":{"name":"Spring Screaming","type":3},"1045":{"name":"桜の風","type":4},"1046":{"name":"HARURUNRUN","type":1},"1047":{"name":"恋が咲く季節","type":4},"1048":{"name":"always","type":4},"1049":{"name":"銀のイルカと熱い風","type":4},"1050":{"name":"Trust me","type":4},"1051":{"name":"君への詩","type":4},"1052":{"name":"未完成の歴史","type":2},"1901":{"name":"お願い ! シンデレラ","type":4},"1902":{"name":"BEYOND \nTHE STARLIGHT","type":4},"1903":{"name":"きらりんロボのテーマ","type":4},"1904":{"name":"∀NSWER \n〜ののの物語〜","type":4},"2001":{"name":"ラブレター","type":1},"2002":{"name":"Jet to the Future","type":2},"2003":{"name":"あんきら ! ？狂騒曲","type":1},"2004":{"name":"情熱\nファンファンファーレ","type":3},"2005":{"name":"∀NSWER","type":4},"2006":{"name":"モーレツ★\n世直しギルティ !","type":3},"2007":{"name":"Kawaii \nmake MY day!","type":1},"2008":{"name":"双翼の独奏歌","type":2},"2009":{"name":"Twin☆くるっ★テール","type":3},"2010":{"name":"Trinity Field","type":2},"2011":{"name":"美に入り彩を穿つ","type":4},"2012":{"name":"Virgin Love","type":3},"2013":{"name":"凸凹スピードスター","type":1},"2014":{"name":"クレイジークレイジー","type":1},"2015":{"name":"Pretty Liar","type":2},"2016":{"name":"アンデッド・\nダンスロック","type":2},"2017":{"name":"Sunshine See May","type":3},"2018":{"name":"Palette","type":1},"2018":{"name":"Palette","type":4},"2019":{"name":"Needle Light","type":2},"2020":{"name":"義勇忍侠花吹雪","type":4},"2021":{"name":"スパイスパラダイス","type":3},"2022":{"name":"Fascinate","type":1},"2022":{"name":"Fascinate","type":4},"2023":{"name":"O-Ku-Ri-Mo-No \nSunday!","type":3},"3001":{"name":"S(mile)ING!","type":1},"3002":{"name":"Never say never","type":2},"3003":{"name":"ミツボシ☆☆★","type":3},"3004":{"name":"風色メロディ","type":1},"3005":{"name":"華蕾夢ミル狂詩曲 \n～魂ノ導～","type":2},"3006":{"name":"ましゅまろ☆キッス","type":3},"3007":{"name":"あんずのうた","type":1},"3008":{"name":"You're stars \nshine on me","type":2},"3009":{"name":"DOKIDOKIリズム","type":3},"3010":{"name":"おねだり \nShall We ～?","type":1},"3011":{"name":"ヴィーナス\nシンドローム","type":2},"3012":{"name":"Romantic Now","type":3},"3013":{"name":"ショコラ・ティアラ","type":1},"3014":{"name":"Twilight Sky","type":2},"3015":{"name":"TOKIMEKI\nエスカレート","type":3},"3016":{"name":"こいかぜ","type":2},"3017":{"name":"Naked Romance","type":1},"3018":{"name":"アップルパイ・\nプリンセス","type":3},"3019":{"name":"Angel Breeze","type":2},"3020":{"name":"熱血乙女A","type":3},"3021":{"name":"メルヘンデビュー !","type":1},"3022":{"name":"To my darling...","type":1},"3023":{"name":"エヴリデイドリーム","type":1},"3024":{"name":"小さな恋の密室事件","type":2},"3025":{"name":"お散歩カメラ","type":3},"3026":{"name":"毒茸伝説","type":3},"3027":{"name":"2nd SIDE","type":2},"3028":{"name":"薄荷 -ハッカ-","type":2},"3029":{"name":"花簪 \nHANAKANZASHI","type":1},"3030":{"name":"ミラクルテレパシー","type":3},"3031":{"name":"Bright Blue","type":2},"3032":{"name":"気持ちいいよね　\n一等賞 !","type":3},"3033":{"name":"き・ま・ぐ・れ☆\nCafé au lait !","type":1},"3034":{"name":"Hotel Moonside","type":2},"3035":{"name":"みんなのきもち","type":3},"3036":{"name":"in fact","type":2},"3037":{"name":"Can't Stop!!","type":3},"3038":{"name":"秘密のトワレ","type":1},"3039":{"name":"青の一番星","type":2},"3040":{"name":"ラヴィアンローズ","type":1},"3041":{"name":"Radio Happy","type":3},"3042":{"name":"恋色エナジー","type":1},"3043":{"name":"共鳴世界の存在論","type":2},"3044":{"name":"lilac time","type":3},"3045":{"name":"恋のHamburg♪","type":1},"3046":{"name":"追い風Running","type":1},"3047":{"name":"One Life","type":2},"3048":{"name":"祈りの花","type":3},"3049":{"name":"楽園","type":1},"3050":{"name":"Last Kiss","type":2},"3051":{"name":"おんなの道は星の道","type":3},"3052":{"name":"谷の底で咲く花は","type":1},"5001":{"name":"Star!!","type":4},"5002":{"name":"夕映えプレゼント","type":4},"5003":{"name":"GOIN'!!!","type":4},"5004":{"name":"できたて \nEvo! Revo! Generation!","type":4},"5005":{"name":"Happy×2 Days","type":1},"5006":{"name":"-LEGNE- \n仇なす剣 光の旋律","type":2},"5007":{"name":"Memories","type":2},"5008":{"name":"ØωØver!!","type":1},"5009":{"name":"LET'S GO HAPPY!!","type":3},"5010":{"name":"Shine!!","type":4},"5011":{"name":"夢色ハーモニー","type":4},"5013":{"name":"私色ギフト","type":3},"5014":{"name":"Heart Voice","type":1},"5015":{"name":"Rockin' Emotion","type":3},"5017":{"name":"Wonder goes on!!","type":4},"5018":{"name":"この空の下","type":2},"5020":{"name":"Nebula Sky","type":2},"5021":{"name":"Trancing Pulse","type":2},"5022":{"name":"心もよう","type":4},"5024":{"name":"流れ星キセキ","type":4},"5025":{"name":"M@GIC☆","type":4},"5026":{"name":"Nocturne","type":2},"5027":{"name":"shabon song","type":1},"5028":{"name":"STORY","type":4},"5029":{"name":"あいくるしい","type":4},"5030":{"name":"Flip Flop","type":3},"5031":{"name":"Lunatic Show","type":2},"5032":{"name":"キラッ ! 満開スマイル","type":1},"5033":{"name":"エチュードは1曲だけ","type":2},"5034":{"name":"SUN♡FLOWER","type":3},"7003":{"name":"shabon song \n～For SS3A rearrange Mix～","type":3},"7004":{"name":"Nocturne \n～For SS3A rearrange Mix～","type":2},"7005":{"name":"Flip Flop \n～For SS3A rearrange Mix～","type":2},"7006":{"name":"あいくるしい \n～For SS3A rearrange Mix～","type":1},"7007":{"name":"Lunatic Show \n～For SS3A rearrange Mix～","type":3},"7008":{"name":"輝く世界の魔法 \n-Magical Step Forward Remix-","type":4},"7009":{"name":"ゴキゲンParty Night \n-Dance!!!!!!!!!!!!!!! Remix-","type":4},"7010":{"name":"Near to You \n-PicoPico D'n'B Remix-","type":4},"8001":{"name":"キミとボクのミライ","type":4},"8002":{"name":"エンジェル ドリーム","type":4},"8003":{"name":"夏色","type":3},"8004":{"name":"サヨナラバス","type":2},"8005":{"name":"LOVE & PEACH","type":1},"8007":{"name":"HOT LIMIT","type":1},"8008":{"name":"行くぜっ ! 怪盗少女","type":3},"8009":{"name":"友達の唄","type":3},"8010":{"name":"虹","type":2},"8011":{"name":"スターラブレイション","type":3},"8012":{"name":"ツバサ","type":2},"9001":{"name":"とどけ ! アイドル","type":4},"9002":{"name":"Snow Wings","type":4},"9003":{"name":"Tulip","type":4},"9004":{"name":"ハイファイ☆デイズ","type":4},"9005":{"name":"生存本能\nヴァルキュリア","type":4},"9006":{"name":"純情Midnight伝説","type":4},"9007":{"name":"Love∞Destiny","type":4},"9008":{"name":"サマカニ ! !","type":4},"9009":{"name":"BEYOND \nTHE STARLIGHT","type":4},"9010":{"name":"命燃やして恋せよ乙女","type":4},"9011":{"name":"Sweet Witches' Night \n～6人目はだぁれ～","type":4},"9012":{"name":"桜の頃","type":4},"9013":{"name":"Nothing but You","type":4},"9014":{"name":"With Love","type":4},"9015":{"name":"リトルリドル","type":4},"9016":{"name":"イリュージョニスタ !","type":4},"9017":{"name":"Happy New Yeah!","type":4},"9018":{"name":"ガールズ・イン・\nザ・フロンティア","type":4},"9019":{"name":"ドレミファクトリー !","type":4},"9020":{"name":"Starry-Go-Round","type":4},"9021":{"name":"ガールズ・イン・\nザ・フロンティア","type":4},"9901":{"name":"Yes! Party Time!!","type":4},"9902":{"name":"Yes! Party Time!!","type":4},"9903":{"name":"Vast world","type":4},"90001":{"name":"ぴにゃリクエスト","type":4}};